Autodesk.Revit.UI.SyncWithScenarioData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.SyncWithScenarioData.SyncImmediately
Synchronizes immediately, otherwise will synchronize when idling.

Autodesk.Revit.UI.SyncWithScenarioData.CheckDisconnect
Checks whether the document needs be disconnected from Scenario.

Autodesk.Revit.UI.SyncWithScenarioData
Data class for SyncWithScenario operation.